Все вместе 2
Дано натуральное число. Напишите программу, которая вычисляет:

количество цифр 3 в нем;
сколько раз в нем встречается последняя цифра;
количество четных цифр;
сумму его цифр, больших пяти;
произведение цифр, больших семи (если цифр больших семи нет, то вывести 1, если такая цифра одна, то вывести ее);
сколько раз в нем встречается цифры 0 и 5 (всего суммарно).



# put your python code here
n = int(input())
count_3=0     # Счетчик для цифр 3
l_digi = n%10   # Последняя цифра, для сравнения
m_l_digi = 0    # Счётчик последний цифры, если она встретится конечно
chetni = 0      # Cчётчик чётных
bolshe_5 = 0    # Костыль для 'суммы больше 5'
proiz_7 = 1     # Счётчик с костылём ниже, всё для того же
s_proiz_7 = 0
su_0_5 = 0      # Счётчик для произведения 0 и 5
while n!=0:
    last_digit=n%10
    if last_digit==3:  # Условие для счёта цифр 3
        count_3+=1
    if last_digit==l_digi:   # Этим условием сравниваем есть цифра или нет
        m_l_digi+=1          # Если встретится увидим
    if last_digit%2==0:      # Условия для отбора чётных
        chetni+=1
    if last_digit>5:         # Само условие отбора под 'больше 5'
        bolshe_5+=last_digit
    if last_digit>7:         # Здесь отбор, если число больше 7, умножаем его на счётчик произведения и плюсуем в костыль s_proiz_7, для дальнейшего отбора
        proiz_7*=last_digit
        s_proiz_7+=1
    if last_digit==0 or last_digit==5:   # Тут как обычно всё
        su_0_5+=1                 
    n//=10    
print(count_3)    
print(m_l_digi)
print(chetni)
print(bolshe_5)
if s_proiz_7==0:   # А вот эта дикота для дополнительного отбора в скобка, читайте, если нет, если есть. Это всё в контексте произведения цифр больше семи
    print(1)
elif s_proiz_7==1:
    print(proiz_7)
else:
    print(proiz_7)
print(su_0_5)


Эту задачу зачем-то включили в экзаменационную на курсе. Больше на внимательность и усидчивость если честно, как по мне. 
Но тем не менее, более ли менее чудеснеееееее!!!